In [1]:
import pandas as pd

In [2]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [5]:
result = student_data.groupby('school_code')

In [8]:
result.get_group('s001')

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [9]:
print(type(result))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

2. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [11]:
result.agg({'age':['min','max','mean']}).reset_index()

  school_code age
              min max  mean
0        s001  12  13  12.5
1        s002  12  14  13.0
2        s003  13  13  13.0
3        s004  12  12  12.0

3. Write a Pandas program to split the following given dataframe into groups based on school code and class

In [14]:
result = student_data.groupby(['school_code','class'])

4. Write a Pandas program to split the following given dataframe into groups based on school code and cast grouping as a list.

In [17]:
print(list(result))

[(('s001', 'V'),    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1  ), (('s001', 'VI'),    school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1  ), (('s002', 'V'),    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  ), (('s003', 'VI'),    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), (('s004', 'VI'),    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )]

6. Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group.

In [18]:
result = student_data.groupby('school_code')

In [19]:
result.get_group('s001')

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [20]:
diamonds = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/diamonds.csv')

In [25]:
diamonds.groupby(['cut','color'], as_index = False).agg({'depth':'mean'})

          cut color      depth
0        Fair     D  64.048466
1        Fair     E  63.319643
2        Fair     F  63.508013
3        Fair     G  64.339809
4        Fair     H  64.585149
5        Fair     I  64.220571
6        Fair     J  64.357143
7        Good     D  62.365710
8        Good     E  62.203751
9        Good     F  62.202310
10       Good     G  62.526636
11       Good     H  62.499573
12       Good     I  62.475096
13       Good     J  62.395765
14      Ideal     D  61.678370
15      Ideal     E  61.686677
16      Ideal     F  61.675562
17      Ideal     G  61.700164
18      Ideal     H  61.733194
19      Ideal     I  61.793598
20      Ideal     J  61.821987
21    Premium     D  61.169245
22    Premium     E  61.175909
23    Premium     F  61.259974
24    Premium     G  61.279480
25    Premium     H  61.322034
26    Premium     I  61.328641
27    Premium     J  61.390099
28  Very Good     D  61.750165
29  Very Good     E  61.730250
30  Very Good     F  61.721627
31  Very Good     G  61.841279
32  Very Good     H  61.968366
33  Very Good     I  61.934551
34  Very Good     J  61.902065

In [31]:
import numpy as np

In [33]:
diamonds.select_dtypes(include=np.number).diff()

       carat  depth  table  price     x     y     z
0        NaN    NaN    NaN    NaN   NaN   NaN   NaN
1      -0.02   -1.7    6.0    0.0 -0.06 -0.14 -0.12
2       0.02   -2.9    4.0    1.0  0.16  0.23  0.00
3       0.06    5.5   -7.0    7.0  0.15  0.16  0.32
4       0.02    0.9    0.0    1.0  0.14  0.12  0.12
...      ...    ...    ...    ...   ...   ...   ...
53935   0.00   -1.9   -2.0    0.0  0.06  0.03 -0.08
53936   0.00    2.3   -2.0    0.0 -0.06 -0.01  0.11
53937  -0.02   -0.3    5.0    0.0 -0.03 -0.07 -0.05
53938   0.16   -1.8   -2.0    0.0  0.49  0.44  0.18
53939  -0.11    1.2   -3.0    0.0 -0.32 -0.25 -0.10

[53940 rows x 7 columns]

In [51]:
student_data

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [57]:
data = {
    "firstname": ["Sally", "Mary", "John"],
    "age": [50, 40, 30]
}

df = pd.DataFrame(data)

for index, row in df.iterrows():
    print(row["firstname"])

Sally
Mary
John

In [78]:
diamonds.apply(lambda row: fn(row['x'],row['y']), axis = 1, result_type='expand')

               0          1
0       7.990228   8.990228
1       7.630643   8.630643
2       8.160099   9.160099
3       8.490214   9.490214
4       8.710023   9.710023
...          ...        ...
53935  11.530017  12.530017
53936  11.560633  12.560633
53937  11.380071  12.380071
53938  12.210146  13.210146
53939  11.780274  12.780274

[53940 rows x 2 columns]

In [71]:
def fn(a,b):
    if a*b != 0:
        c = (a+b)/a*b
        return c, c+1
    if a*b == 0:
        return 1 ,1

In [90]:
def func2(row):
    if (row['x'] * row['y']) != 0:
        row['m'] =row['x']+row['y']/(row['x'] * row['y'])
        row['w'] =row['x']-row['y']/(row['x'] * row['y'])
        return row
    else:
        return row

In [91]:
diamonds.apply(func2, axis=1)

,carat,clarity,color,cut,depth,m,price,table,w,x,y,z
0,0.23,SI2,E,Ideal,61.5,4.203165,326,55.0,3.696835,3.95,3.98,2.43
1,0.21,SI1,E,Premium,59.8,4.147069,326,61.0,3.632931,3.89,3.84,2.31
2,0.23,VS1,E,Good,56.9,4.296914,327,65.0,3.803086,4.05,4.07,2.31
3,0.29,VS2,I,Premium,62.4,4.438095,334,58.0,3.961905,4.20,4.23,2.63
4,0.31,SI2,J,Good,63.3,4.570415,335,58.0,4.109585,4.34,4.35,2.75
...,...,...,...,...,...,...,...,...,...,...,...,...
53935,0.72,SI1,D,Ideal,60.8,5.923913,2757,57.0,5.576087,5.75,5.76,3.50
53936,0.72,SI1,D,Good,63.1,5.865747,2757,55.0,5.514253,5.69,5.75,3.61
53937,0.70,SI1,D,Very Good,62.8,5.836678,2757,60.0,5.483322,5.66,5.68,3.56
53938,0.86,SI2,H,Premium,61.0,6.312602,2757,58.0,5.987398,6.15,6.12,3.74
53939,0.75,SI2,D,Ideal,62.2,6.001527,2757,55.0,5.658473,5.83,5.87,3.64